; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v2 - type_2 ?v4 - type_1)
 	      (pred_1 ?v8 - object ?v4 - type_1)
	      (pred_2 ?v2 - type_2 ?v1 - type_3)
	      (pred_3 ?v2 - type_2 ?v8 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v5 ?v7 - type_1)
       :precondition (and  (pred_4 ?v2 ?v5))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v3 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v3) (pred_4 ?v2 ?v3) (pred_2 ?v2 ?v1))
       :effect (and (pred_3 ?v2 ?v6 ?v1)
		    (not (pred_1 ?v6 ?v3)) 
		    (not (pred_2 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_2 ?v6 - object ?v3 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v6 ?v1) (pred_4 ?v2 ?v3))
       :effect (and (pred_1 ?v6 ?v3)
		    (pred_2 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v6 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_07 obj_05 - type_2
obj_03 obj_01 obj_04 obj_08 - type_3
obj_06 obj_11 obj_09 - type_1
obj_02 obj_10 - object)
(:init
(pred_4 obj_07 obj_11)
(pred_2 obj_07 obj_03)
(pred_2 obj_07 obj_01)
(pred_4 obj_05 obj_11)
(pred_2 obj_05 obj_04)
(pred_2 obj_05 obj_08)
(pred_1 obj_02 obj_11)
(pred_1 obj_10 obj_09)
)
(:goal
(and
(pred_1 obj_02 obj_11)
(pred_1 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_09)))
)
)

; plan
1. (op_2 obj_05 obj_11 obj_09)
   deleted: (pred_4 obj_05 obj_11)
   added: (pred_4 obj_05 obj_09)
   goals met: 1 of 2
2. (op_1 obj_05 obj_10 obj_09 obj_08)
   deleted: (pred_1 obj_10 obj_09) (pred_2 obj_05 obj_08)
   added: (pred_3 obj_05 obj_10 obj_08)
   goals met: 1 of 2
3. (op_2 obj_05 obj_09 obj_11)
   deleted: (pred_4 obj_05 obj_09)
   added: (pred_4 obj_05 obj_11)
   goals met: 1 of 2
4. (op_3 obj_05 obj_10 obj_11 obj_08)
   deleted: (pred_3 obj_05 obj_10 obj_08)
   added: (pred_1 obj_10 obj_11) (pred_2 obj_05 obj_08)
   goals met: 2 of 2
